**** Variable name examples:

#+begin_src js :results output

  // No !!!
  var 1name = 'john';

#+end_src

#+begin_src js :results output

  // JQuery...
  var $name = 'den';
  console.log($name);

  // private variables...
  var _name = 'denny';
  console.log(_name);

#+end_src

#+RESULTS:
: den
: denny

*** Var Example

#+begin_src js :results output

  var name ='John Doe';
  console.log(name);
  name = 'Dennis Mitchell';     //  Reassignment (Dynamic)
  console.log(name);

  // Initializing a variable
  var greeting;
  console.log(greeting);

#+end_src

#+RESULTS:
: John Doe
: Dennis Mitchell
: undefined

*** const

Use const type whenever possble, to make code more secure and readable

#+begin_src js :results output

  // Object
  const Person = {
      name: "Dennis",
      age: 53
      }

  console.log(Person);
  console.log(Person.name);
  console.log(typeof(Person));

  // Arrays
  const numbers = [1,2,3,4,5];
  numbers.push(6);
  
  console.log(numbers);
  console.log(numbers[4]);



#+end_src

#+RESULTS:
: { name: 'Dennis', age: 53 }
: Dennis
: object
: [ 1, 2, 3, 4, 5, 6 ]
: 5

**** Reference Examples:

#+begin_src js :results output

  // Array
  const hobbies = ['movies', 'music'];
  console.log(typeof hobbies);

  // Array actual type tip
  if (hobbies.constructor.name == 'Array') {
      console.log('hobbies is an Array');
  }

  // Objects literal
  const address = {
      city: 'Miami',
      state: 'Florida'
  }

  const today = new Date();

  console.log(today);
  console.log(typeof today);

#+end_src

#+RESULTS:
: object
: hobbies is an Array
: 2021-11-20T17:17:38.759Z
: object

*** toString, to number:
#+begin_src js :results output

  // toString()
  val = (5).toString();
  val = (true).toString();
  val = String(5);
  console.log(typeof val);

  // to Number
  val = Number('5');
  val = parseInt('100');
  val = parseFloat('100');
  console.log(val.toFixed(2));

#+end_src

#+RESULTS:
: string
: 100.00

